<a href="https://colab.research.google.com/github/superherobtf1985/pandas3/blob/master/Pandas3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# pandasの基本3

In [0]:
import pandas as pd

In [2]:
kanto_df = pd.read_csv("kanto.csv")
kanto_df

  prefecture region capital_city major_station_1 major_station_2
0      Tokyo  Kanto        Tokyo           Tokyo        Shinjuku
1    Saitama  Kanto      Saitama           Omiya           Urawa
2   Kanagawa  Kanto     Yokohama        Yokohama        Kawasaki

In [3]:
kansai_df = pd.read_csv("kansai.csv")
kansai_df

  prefecture  region capital_city major_station_1
0      Osaka  Kansai        Osaka           Umeda
1      Kyoto  Kansai        Kyoto           Kyoto
2       Nara  Kansai         Nara            Nara
3      Hyogo  Kansai         Kobe            Kobe

## 2つのデータを連結する

In [4]:
kanto_kansai_df = pd.concat([kanto_df, kansai_df], sort=True).reset_index(drop=True)
kanto_kansai_df

  capital_city major_station_1 major_station_2 prefecture  region
0        Tokyo           Tokyo        Shinjuku      Tokyo   Kanto
1      Saitama           Omiya           Urawa    Saitama   Kanto
2     Yokohama        Yokohama        Kawasaki   Kanagawa   Kanto
3        Osaka           Umeda             NaN      Osaka  Kansai
4        Kyoto           Kyoto             NaN      Kyoto  Kansai
5         Nara            Nara             NaN       Nara  Kansai
6         Kobe            Kobe             NaN      Hyogo  Kansai

CSVファイルに書き出し

In [0]:
kanto_kansai_df.to_csv("kanto_kansai.csv")

class.csvとgrade.csvを読み込む

In [6]:
class_df = pd.read_csv("class.csv")
class_df

   student_number     name  age    nationality
0               1     Jack    7        England
1               2     John   10  United States
2               3    Alice   12        England
3               4      Bob    7      Australia
4               5  Dominic    8        Germany
5               6    Akiko   11          Japan
6               7    Carly    6         Canada

In [7]:
grade_df = pd.read_csv("grade.csv")
grade_df

   student_number     name  math  science
0               1     Jack    32       19
1               2     John    73       63
2               3    Alice    90       85
3               5  Dominic    45       58
4               6    Akiko    87       66

## nameカラムをキー値に2つのデータを内部結合

In [8]:
class_grade_df = pd.merge(class_df, grade_df, on=["student_number", "name"], how="inner")
class_grade_df

   student_number     name  age    nationality  math  science
0               1     Jack    7        England    32       19
1               2     John   10  United States    73       63
2               3    Alice   12        England    90       85
3               5  Dominic    8        Germany    45       58
4               6    Akiko   11          Japan    87       66

In [0]:
class_grade_df.to_csv("class_grade.csv")